3375/3375 - 57s - loss: 0.4577 - sparse_categorical_accuracy: 0.8579 - val_loss: 0.3140 - val_sparse_categorical_accuracy: 0.9097
Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding (Embedding)        multiple                  4358432   
_________________________________________________________________
time_distributed (TimeDistri multiple                  128       
_________________________________________________________________
conv1d (Conv1D)              multiple                  3104      
_________________________________________________________________
dropout (Dropout)            multiple                  0         
_________________________________________________________________
re_lu (ReLU)                 multiple                  0         
_________________________________________________________________
max_pooling1d (MaxPooling1D) multiple                  0         
_________________________________________________________________
time_distributed_1 (TimeDist multiple                  256       
_________________________________________________________________
conv1d_1 (Conv1D)            multiple                  6208      
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
_________________________________________________________________
re_lu_1 (ReLU)               multiple                  0         
_________________________________________________________________
max_pooling1d_1 (MaxPooling1 multiple                  0         
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  5636      
=================================================================
Total params: 4,373,764
Trainable params: 4,373,572
Non-trainable params: 192
_________________________________________________________________
238/238 - 1s - loss: 0.3072 - sparse_categorical_accuracy: 0.9120
